# 1. Define a function

## 1.1 Nomal function

In [ ]:
def my_function(x):
    a = x + 1
#     print("a = ", a)
    return a

a1 = my_function(6)

In [ ]:
a = ['1',2]
len(a)

In [ ]:
def is_prime(x):
    a = [i for i in range(1,x+1) if x%i==0]
    if len(a) > 2:
        return False
    else:
        return True

In [ ]:
a = is_prime(9)

In [ ]:
a

In [1]:
# scope of a variable

# y = 5
def func(x):
    a = []
    for i in range(x):
        a.append(i)
#     print (a)
    c = a
    return (c)

## 1.2 Lambda function

In [3]:
x = lambda a, b, c : a + b + c
print(x(5, 6, 2))

13

In [ ]:
x = lambda a : a + 10
print(x(5))

In [ ]:
ints = ['Jo', 'Emily', 'Michael', 'Mar', 'Steven']
new_sorted = sorted(ints, key=lambda x: x.lower().count('e'))
new_sorted

# 2. Apply a function to DataFrame

## 2.1 Map

In [4]:
import pandas as pd

df = pd.DataFrame({
    'gender':['male', 'female', 'female', 'male', 'male']
})

df

   gender
0    male
1  female
2  female
3    male
4    male

In [5]:
gender_map ={'male':1, 'female':0}
df['numeric_gender'] =  df['gender'].map(gender_map)
df

   gender  numeric_gender
0    male               1
1  female               0
2  female               0
3    male               1
4    male               1

## 2.2 ApplyMap

In [6]:

sample = pd.DataFrame({'a':[1,2,3,4], 'b':[4,5,6,7]})
sample

   a  b
0  1  4
1  2  5
2  3  6
3  4  7

In [7]:
applyMap_df = sample.applymap(lambda x: x*2)
applyMap_df

   a   b
0  2   8
1  4  10
2  6  12
3  8  14

## 2.3 Apply

In [8]:
import numpy as np

In [9]:
sample

   a  b
0  1  4
1  2  5
2  3  6
3  4  7

In [10]:
apply_series = sample.apply(np.mean, axis=0)
apply_series

a    2.5
b    5.5
dtype: float64

In [11]:
apply_series = sample.apply(np.mean, axis=1)
apply_series

0    2.5
1    3.5
2    4.5
3    5.5
dtype: float64

In [12]:
sample

   a  b
0  1  4
1  2  5
2  3  6
3  4  7

In [13]:
# Create new column base on value of other coulumns
def complex_caculation(x, y):
    t = x**2 + y**3
    return t

sample['c'] = sample.apply(lambda row: complex_caculation(row['a'], row['b']), axis = 1)

In [14]:
sample

   a  b    c
0  1  4   65
1  2  5  129
2  3  6  225
3  4  7  359

# 3. Groupby and aggregation with multiple index

In [15]:
groupby_agg_df = pd.DataFrame(data={
    'col1':['A', 'A', 'A', 'A', 'C', 'C', 'C', 'E', 'E', 'G'], 
    'col2': ['B', 'B', 'B', 'B', 'D', 'D', 'D', 'F', 'F', 'H'],
    'col3': [1, 1, 2, 2, 2, 1, 5, 2, 2, 3],
    'col4': [1, 1, 2, 2, 2, 1, 5, 2, 2, 4],
    'col5': [1, 1, 2, 2, 2, 1, 5, 2, 2, 5],
    'col6': [1, 1, 2, 2, 2, 1, 5, 2, 2, 6],
})

groupby_agg_df

  col1 col2  col3  col4  col5  col6
0    A    B     1     1     1     1
1    A    B     1     1     1     1
2    A    B     2     2     2     2
3    A    B     2     2     2     2
4    C    D     2     2     2     2
5    C    D     1     1     1     1
6    C    D     5     5     5     5
7    E    F     2     2     2     2
8    E    F     2     2     2     2
9    G    H     3     4     5     6

In [17]:
g = groupby_agg_df.groupby(['col1', 'col2'])['col3'].count().rename('Count_col3')
g

col1  col2
A     B       4
C     D       3
E     F       2
G     H       1
Name: Count_col3, dtype: int64

In [18]:
g.reset_index() # dataframe

  col1 col2  Count_col3
0    A    B           4
1    C    D           3
2    E    F           2
3    G    H           1

In [19]:
group_agg = groupby_agg_df.groupby(['col1','col2']).agg({
                                                            'col3':[min, 'count'],
                                                            'col4':[max, 'count']
                                                        })
group_agg

          col3       col4
           min count  max count
col1 col2
A    B       1     4    2     4
C    D       1     3    5     3
E    F       2     2    2     2
G    H       3     1    4     1

In [20]:
group_agg.columns = ['_'.join(x) for x in group_agg.columns]
group_agg.reset_index()

  col1 col2  col3_min  col3_count  col4_max  col4_count
0    A    B         1           4         2           4
1    C    D         1           3         5           3
2    E    F         2           2         2           2
3    G    H         3           1         4           1

# 4. Pivot Tables and Cross-Tabulation

## 4.1 Pivot

In [ ]:
import pandas as pd
import numpy as np

In [21]:
pivot_df = pd.DataFrame({
    'Account':[714466, 714466, 714466, 737550, 146832],
    'Name':['Trantow-Barrows', 'Trantow-Barrows', 'Trantow-Barrows', 'Fritsch, Russel and Anderson', 'Kiehn-Spinka'],
    'Rep':['Craig Booker', 'Craig Booker', 'Craig Booker', 'Craig Booker','Daniel Hinton'],
    'Manager': ['Debra Henley', 'Debra Henley', 'Debra Henley', 'Debra Henley', 'Debra Henley'],
    'Product': ['CPU', 'Software', 'Maintenance', 'CPU', 'CPU'],
    'Quantity': [1, 1, 2, 1,2],
    'Price':[30000, 10000, 5000, 35000, 65000],
    'Status': ['presented', 'presented', 'pending', 'won', 'won']
})

pivot_df

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,won
4,146832,Kiehn-Spinka,Daniel Hinton,Debra Henley,CPU,2,65000,won

In [22]:
pivot_df['revenue'] =  pivot_df['Quantity'] * pivot_df['Price']

In [23]:
total_pivot_df = pivot_df.groupby('Product')['revenue'].sum().rename('total_rev').reset_index()
total_pivot_df

       Product  total_rev
0          CPU     195000
1  Maintenance      10000
2     Software      10000

In [25]:
pivot_df.pivot_table(index='Product'
                     , columns='Status'
                     , values = ['Quantity','Price']
                     , aggfunc={'Quantity':sum, 'Price':min})

              Price                    Quantity
Status      pending presented      won  pending presented  won
Product
CPU             NaN   30000.0  35000.0      NaN       1.0  3.0
Maintenance  5000.0       NaN      NaN      2.0       NaN  NaN
Software        NaN   10000.0      NaN      NaN       1.0  NaN

In [26]:
pivot_df.pivot_table(
    index = ['Manager', 'Status'],
    columns = ['Product'], 
    aggfunc = [np.sum],
    values = ['Price'], 
    margins = True, 
    dropna = True
)

                             sum
                           Price
Product                      CPU Maintenance Software     All
Manager      Status
Debra Henley pending         NaN      5000.0      NaN    5000
             presented   30000.0         NaN  10000.0   40000
             won        100000.0         NaN      NaN  100000
All                     130000.0      5000.0  10000.0  145000

## 4.2 Crosstab

In [27]:
pd.crosstab(
    index = pivot_df['Status'],
    columns = pivot_df['Product'], 
    margins = True, 
    dropna = True
)

Product    CPU  Maintenance  Software  All
Status
pending      0            1         0    1
presented    1            0         1    2
won          2            0         0    2
All          3            1         1    5